phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_16_896.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 896
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 896 tps: 109675.59 qps: 109675.59 (r/w/o: 0.00/109675.59/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 896 tps: 87028.98 qps: 87029.31 (r/w/o: 0.00/87029.31/0.00) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 896 tps: 76668.58 qps: 76668.25 (r/w/o: 0.00/76668.25/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 896 tps: 32216.25 qps: 32216.25 (r/w/o: 0.00/32216.25/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 896 tps: 86693.42 qps: 86693.42 (r/w/o: 0.00/86693.42/0.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 896 tps: 70075.42 qps: 70075.42 (r/w/o: 0.00/70075.42/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 896 tps: 93190.44 qps: 93190.44 (r/w/o: 0.00/93190.44/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 896 tps: 53000.61 qps: 53000.61 (r/w/o: 0.00/53000.61/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 896 tps: 75627.95 qps: 75627.95 (r/w/o: 0.00/75627.95/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 896 tps: 66508.17 qps: 66508.17 (r/w/o: 0.00/66508.17/0.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2253518
        other:                           0
        total:                           2253518
    transactions:                        2253518 (74722.37 per sec.)
    queries:                             2253518 (74722.37 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.1561s
    total number of events:              2253518

Latency (ms):
         min:                                  0.63
         avg:                                 11.93
         max:                                690.72
         95th percentile:                     33.12
         sum:                            26894125.84

Threads fairness:
    events (avg/stddev):           2515.0871/55.03
    execution time (avg/stddev):   30.0158/0.02