phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_128.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 128 tps: 48839.24 qps: 48839.24 (r/w/o: 0.00/48839.24/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 65898.32 qps: 65898.32 (r/w/o: 0.00/65898.32/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 56190.72 qps: 56190.72 (r/w/o: 0.00/56190.72/0.00) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 128 tps: 63012.18 qps: 63012.18 (r/w/o: 0.00/63012.18/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 128 tps: 59375.47 qps: 59375.47 (r/w/o: 0.00/59375.47/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 128 tps: 41483.83 qps: 41483.83 (r/w/o: 0.00/41483.83/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 128 tps: 41095.35 qps: 41095.35 (r/w/o: 0.00/41095.35/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 128 tps: 53252.01 qps: 53252.01 (r/w/o: 0.00/53252.01/0.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 128 tps: 41301.00 qps: 41301.00 (r/w/o: 0.00/41301.00/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 43801.78 qps: 43801.78 (r/w/o: 0.00/43801.78/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1543093
        other:                           0
        total:                           1543093
    transactions:                        1543093 (51384.69 per sec.)
    queries:                             1543093 (51384.69 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0271s
    total number of events:              1543093

Latency (ms):
         min:                                  0.65
         avg:                                  2.49
         max:                                130.60
         95th percentile:                      7.30
         sum:                            3837580.05

Threads fairness:
    events (avg/stddev):           12055.4141/70.95
    execution time (avg/stddev):   29.9811/0.01