phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_192.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 192
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 192 tps: 59162.47 qps: 59162.47 (r/w/o: 0.00/59162.47/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 192 tps: 79954.51 qps: 79954.51 (r/w/o: 0.00/79954.51/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 192 tps: 65286.06 qps: 65286.06 (r/w/o: 0.00/65286.06/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 192 tps: 77687.01 qps: 77687.01 (r/w/o: 0.00/77687.01/0.00) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 192 tps: 48969.82 qps: 48969.82 (r/w/o: 0.00/48969.82/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 192 tps: 46836.25 qps: 46836.25 (r/w/o: 0.00/46836.25/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 192 tps: 68295.42 qps: 68295.42 (r/w/o: 0.00/68295.42/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 192 tps: 37637.28 qps: 37637.28 (r/w/o: 0.00/37637.28/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 192 tps: 42633.58 qps: 42633.58 (r/w/o: 0.00/42633.58/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 192 tps: 29567.82 qps: 29567.82 (r/w/o: 0.00/29567.82/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1668689
        other:                           0
        total:                           1668689
    transactions:                        1668689 (55538.01 per sec.)
    queries:                             1668689 (55538.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0430s
    total number of events:              1668689

Latency (ms):
         min:                                  0.67
         avg:                                  3.45
         max:                                157.44
         95th percentile:                     10.27
         sum:                            5758405.04

Threads fairness:
    events (avg/stddev):           8691.0885/65.09
    execution time (avg/stddev):   29.9917/0.01