phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_256.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 256
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 256 tps: 67996.51 qps: 67996.51 (r/w/o: 0.00/67996.51/0.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 256 tps: 82713.25 qps: 82713.25 (r/w/o: 0.00/82713.25/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 256 tps: 77660.90 qps: 77660.90 (r/w/o: 0.00/77660.90/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 256 tps: 76443.11 qps: 76443.11 (r/w/o: 0.00/76443.11/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 256 tps: 45221.94 qps: 45222.27 (r/w/o: 0.00/45222.27/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 256 tps: 65503.28 qps: 65502.94 (r/w/o: 0.00/65502.94/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 256 tps: 43197.26 qps: 43197.26 (r/w/o: 0.00/43197.26/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 256 tps: 53629.38 qps: 53629.38 (r/w/o: 0.00/53629.38/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 256 tps: 37232.89 qps: 37232.89 (r/w/o: 0.00/37232.89/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 256 tps: 24854.32 qps: 24854.32 (r/w/o: 0.00/24854.32/0.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1723905
        other:                           0
        total:                           1723905
    transactions:                        1723905 (57356.99 per sec.)
    queries:                             1723905 (57356.99 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0524s
    total number of events:              1723905

Latency (ms):
         min:                                  0.64
         avg:                                  4.45
         max:                                338.27
         95th percentile:                     12.75
         sum:                            7679428.10

Threads fairness:
    events (avg/stddev):           6734.0039/58.51
    execution time (avg/stddev):   29.9978/0.01