phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_320.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 320
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 320 tps: 74576.24 qps: 74576.24 (r/w/o: 0.00/74576.24/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 320 tps: 86738.24 qps: 86738.24 (r/w/o: 0.00/86738.24/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 320 tps: 90525.13 qps: 90525.13 (r/w/o: 0.00/90525.13/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 320 tps: 69559.38 qps: 69559.38 (r/w/o: 0.00/69559.38/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 320 tps: 50505.50 qps: 50505.50 (r/w/o: 0.00/50505.50/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 320 tps: 74988.38 qps: 74988.38 (r/w/o: 0.00/74988.38/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 320 tps: 35566.26 qps: 35566.26 (r/w/o: 0.00/35566.26/0.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 320 tps: 55327.55 qps: 55327.55 (r/w/o: 0.00/55327.55/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 320 tps: 29450.30 qps: 29450.30 (r/w/o: 0.00/29450.30/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 320 tps: 24752.54 qps: 24752.54 (r/w/o: 0.00/24752.54/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1776577
        other:                           0
        total:                           1776577
    transactions:                        1776577 (59077.00 per sec.)
    queries:                             1776577 (59077.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0693s
    total number of events:              1776577

Latency (ms):
         min:                                  0.64
         avg:                                  5.40
         max:                                385.36
         95th percentile:                     15.00
         sum:                            9600405.02

Threads fairness:
    events (avg/stddev):           5551.8031/53.58
    execution time (avg/stddev):   30.0013/0.01